Revit 2027 API
SlabShapeEditor Properties
The SlabShapeEditor type exposes the following members.
Properties
Name | Description
IsEnabled | Identifies if the slab shape editing functionality is enabled.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SlabShapeCreases | All of the creases that can be edited.
SlabShapeVertices | All of the vertices that can be edited.
Top
See Also
Reference
SlabShapeEditor Class
Autodesk.Revit.DB Namespace